[
    {
        "title": "Needle Eye",
        "type": ["Unreal Engine"],
        "team": "8 persons",
        "duration": "1 year",
        "description": [
            "Needle Eye is a cozy adventure game based on thread physics, set in a sleepy and aging village, long forgotten. The player's goal is to bring this town back to life in chaotic ways using a magical needle that allow to link anything in the game : objects, environments, NPCs, creatures and the character.",
            "This was my final year project (TFE), where I served as the lead developer. The game won the 'Best TFE Game' award and was selected for the Belgian Games Awards."
        ],
        "src_type": "youtube",
        "src_link": "https://www.youtube.com/embed/tmiN8HGknvE?si=fYkpqLi-yS_Ymrnt",
        "src_alt": "Needle Eye Trailer",
        "icon_link": "src/icons/NeedleEye.png",
        "icon_alt": "Needle Eye"
    },
    {
        "title": "Already Dead",
        "type": ["Unreal Engine"],
        "team": "2 persons",
        "duration": "3 months",
        "description": ["This was my first project using Unreal Engine, developed in close collaboration with a game designer. It provided an opportunity to explore and acquire foundational knowledge of Blueprint.", "This is a third-person 3D puzzle game where dying is used to switch between two different worlds and advance through the levels."],
        "src_type": "image",
        "src_link": "src/images/AlreadyDead.gif",
        "src_alt": "Already Dead gameplay in an animated image.",
        "icon_link": "src/icons/AlreadyDead.svg",
        "icon_alt": "Already Dead"
    },
    {
        "title": "Street Murder",
        "type": ["Unreal Engine"],
        "team": "6 persons",
        "duration": "48 hours",
        "description": ["Street Murder is a stealth-action game created for the KISS Game Jam, in which you play as a serial killer who must deceive civilians and evade the police night after night to commit as many crimes as possible. The gameplay focuses on stealth, sound manipulation, and light management to create confusion and extend your freedom. During this project, I explored AI behavior in depth and gained hands-on experience with Unreal Engine's AI framework."],
        "src_type": "image",
        "src_link": "src/",
        "src_alt": "",
        "icon_link": "src/icons/StreetMurder.png",
        "icon_alt": "Street Murder"
    },
    {
        "title": "Twisted Wishes",
        "type": ["Unity"],
        "team": "5 persons",
        "duration": "1 week",
        "description": ["Twisted Wishes is a fast-paced roguelike created for Brackeys Game Jam 2025. Each level offers a choice between three powerful wishes, which can significantly boost your abilities but can also lead to serious drawbacks. ", "The game was developed in one week on Unity, with a strong focus on building highly generic systems to support a wide range of content and enhance replayability."],
        "src_type": "image",
        "src_link": "src/images/TwistedWishes.gif",
        "src_alt": "",
        "icon_link": "src/icons/TwistedWishes.png",
        "icon_alt": "Twisted Wishes"
    },
    {
        "title": "Mob Survivor",
        "type": ["Unreal Engine"],
        "team": "1 person",
        "duration": "2 months",
        "description": ["This solo project, developed in Unreal Engine, is heavily inspired by Vampire Survivors. Its main purpose was to deepen my understanding of the engine's C++ side. All core mechanics are fully implemented and designed to be modular, allowing for future expansion. I also built an online leaderboard system to enable score comparison between players."],
        "src_type": "image",
        "src_link": "src/images/MobSurvivor.gif",
        "src_alt": "Mob Survivor gameplay in an animated image",
        "icon_link": "src/icons/MobSurvivor.png",
        "icon_alt": "Mob Survivor"
    },
    {
        "title": "Rope Simulation",
        "type": ["Unreal Engine"],
        "team": "1 person",
        "duration": "1 year",
        "description": ["For my final year project, I focused on the realistic simulation of a rope. I chose this topic for my thesis, which led me to dive deep into the inner workings of physics engines like Unreal’s. Through extensive research and study of existing literature, I gained a strong understanding of the subject and am now developing a fully custom physics system in my free time."],
        "src_type": "image",
        "src_link": "src/images/Memoire.png",
        "src_alt": "Cover page of my thesis on Rope Simulation",
        "icon_link": "src/icons/RopeSimulation.png",
        "icon_alt": "Rope Simulation"
    },
    {
        "title": "Catapultia",
        "type": ["Unity"],
        "team": "3 persons",
        "duration": "2 weeks",
        "description": ["This Unity project was developed in two weeks by a small team of three. It's a tower defense game with a twist: you control a catapult. The goal is to eliminate all incoming enemy waves using different types of projectiles, including explosive, bouncy, rock, and freezing shots.", "To succeed, you need to consider various parameters such as wind, launch angle, and the length of the catapult’s arm."],
        "src_type": "image",
        "src_link": "src/images/Catapultia.gif",
        "src_alt": "Catapultia gameplay in an animated image",
        "icon_link": "src/icons/Catapultia.png",
        "icon_alt": "Catapultia"
    },
    {
        "title": "Gamble Gang",
        "type": ["Table Game"],
        "team": "3 persons",
        "duration": "2 months",
        "description": ["", "Although it’s not a video game, this project played an important role in deepening my understanding of game design. It taught me how crucial the player experience is. In fact, no matter how impressive or complex a game system may be, it means nothing if the player isn’t enjoying it."],
        "src_type": "youtube",
        "src_link": "https://www.youtube.com/embed/eMRtcjX8C2M?si=GPA_hxtQ3eJ2Ee04",
        "src_alt": "Gamble Gang Presentation in French",
        "icon_link": "src/icons/GambleGang.png",
        "icon_alt": "Gamble Gang"
    }
]
